{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 9, 100, 1], "dtype": "float32", "sparse": false, "name": "Input"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv3D", "config": {"name": "conv1", "trainable": true, "filters": 16, "kernel_size": [3, 3, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv3D", "config": {"name": "conv2", "trainable": true, "filters": 32, "kernel_size": [2, 2, 1], "strides": [2, 2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv3D", "config": {"name": "conv3", "trainable": true, "filters": 64, "kernel_size": [2, 2, 1], "strides": [2, 2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv4", "class_name": "Conv3D", "config": {"name": "conv4", "trainable": true, "filters": 128, "kernel_size": [2, 2, 1], "strides": [2, 2, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "convlstm4", "class_name": "ConvLSTM2D", "config": {"name": "convlstm4", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "selu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "convlstm3", "class_name": "ConvLSTM2D", "config": {"name": "convlstm3", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "selu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "deconv4", "class_name": "Conv3DTranspose", "config": {"name": "deconv4", "trainable": true, "filters": 64, "kernel_size": [2, 2, 1], "strides": [2, 2, 1], "padding": "same", "data_format": "channels_last", "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [1, 1, 0]}, "inbound_nodes": [[["convlstm4", 0, 0, {}]]]}, {"name": "concat4", "class_name": "Concatenate", "config": {"name": "concat4", "trainable": true, "axis": 4}, "inbound_nodes": [[["convlstm3", 0, 0, {}], ["deconv4", 0, 0, {}]]]}, {"name": "convlstm2", "class_name": "ConvLSTM2D", "config": {"name": "convlstm2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "selu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "deconv3", "class_name": "Conv3DTranspose", "config": {"name": "deconv3", "trainable": true, "filters": 32, "kernel_size": [2, 2, 1], "strides": [2, 2, 1], "padding": "same", "data_format": "channels_last", "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [1, 1, 0]}, "inbound_nodes": [[["concat4", 0, 0, {}]]]}, {"name": "concat3", "class_name": "Concatenate", "config": {"name": "concat3", "trainable": true, "axis": 4}, "inbound_nodes": [[["convlstm2", 0, 0, {}], ["deconv3", 0, 0, {}]]]}, {"name": "convlstm1", "class_name": "ConvLSTM2D", "config": {"name": "convlstm1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "selu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "deconv2", "class_name": "Conv3DTranspose", "config": {"name": "deconv2", "trainable": true, "filters": 16, "kernel_size": [2, 2, 1], "strides": [2, 2, 1], "padding": "same", "data_format": "channels_last", "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [1, 1, 0]}, "inbound_nodes": [[["concat3", 0, 0, {}]]]}, {"name": "concat2", "class_name": "Concatenate", "config": {"name": "concat2", "trainable": true, "axis": 4}, "inbound_nodes": [[["convlstm1", 0, 0, {}], ["deconv2", 0, 0, {}]]]}, {"name": "deconv1", "class_name": "Conv3DTranspose", "config": {"name": "deconv1", "trainable": true, "filters": 1, "kernel_size": [3, 3, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["concat2", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["deconv1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}